app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `login` = 'user1'
 LIMIT 1
SELECT *
FROM `utilisateur`
WHERE `login` = 'user1'
 LIMIT 1
---
    public function login()
    {
        $this->logger("info", "AuthController initialized");

        $this->userModel = new UtilisateurModel();

        $userloginType = "login";
        $userlogin = $this->request->getPost('username');
        $userpassword = $this->request->getPost('password');

        $userpassword = hash('sha256', $userpassword);

        if (str_contains($userlogin, "@")) {
            $userloginType = "mail";
        }
        if ($userloginType == "mail") {
            $this->logger("info", "type MAIL");
            $user = $this->userModel->where('mail', $userlogin)->first();
        } else {
            $this->logger("info", "type USERNAME");
            $user = $this->userModel->where('login', $userlogin)->first();