app/Controllers/RegistrationController.php

INSERT INTO `user` (`login`, `password`, `mail`, `createdAt`) VALUES ('user7779', 'a1159e9df3670d549d04524532629f5477ceb7deec9b45e47e8c009506ecb2c8', 'mailing', '2023-12-12 19:24:50')
---
                    'name' => $name,
                    'firstname' => $firstname
                ];
                if(intval($this->createUserFile($lastUserId, $userFileDatas) > 0)){

SELECT *
FROM `user`
WHERE `mail` = 'mailing'
 LIMIT 1
SELECT *
FROM `user`
WHERE `login` = 'user77799977'
 LIMIT 1
---
    private function isUsernameOrMailAvailable($username, $mail)
    {
        // Check if the username and mail are available in the database
        $existingMail = $this->userModel->where('mail', $mail)->first();
        $existingUser = $this->userModel->where('login', $username)->first();