app/Models/UserProfileModel.php

    public function createNewUserProfile($userDatas)
    {
        $this->logger("info", "UserProfileModel::createNewUserProfile init");
        return parent::insert($userDatas);
---
INSERT INTO `user_profile` (`name`, `firstname`, `idUser`) VALUES ('lulu', 'dede', 20)