app/Models/UtilisateurModel.php

INSERT INTO `user` (`login`, `password`, `mail`, `createdAt`) VALUES ('user1', 'a1159e9df3670d549d04524532629f5477ceb7deec9b45e47e8c009506ecb2c8', 'mail', '2023-12-12 15:47:24')
---
    public function createNewUser($userDatas){
        $this->logger("info", "UtilisateurModel::createNewUser init");